---
title: Basic
category: Cisco
date: 2019-04-15
---

-----

* Створити користувача:
```bash
username admin secret 1234
enable secret admin
line vty 0 4
logging synchronous
login local
```

* Установка пароля для консолі:
```bash
R1(config)#line console 0
R1(config-line)#password cisco
R1(config-line)#login
```

* Установка пароля для telnet:
```bash
R1(config)#line vty 0 4
R1(config-line)#password cisco
R1(config-line)#login
```

* Видалення консольного пароля:
```bash
router(config)#line console 0
router(config-line)#no login
router(config-line)#no password
```

* Видалення пароля Secret:
```bash
router(config)#no enable secret
```

* Перевірка параметра Register:
```bash
router#show version
```

* Задание адреса-маски и административное включение интерфейса:
```bash
R1(config)#interface Serial0/0/0
R1(config-if)#ip address 192.168.2.1 255.255.255.0
```

* Административное выключение интерфейса маршрутизатора:
```bash
router(config)#int s0/0
router(config-if)#shutdown
```

* Включение интерфейса Serial:
```bash
router#configure terminal
router(config)#interface s0/0
router(config-if)#no shutdown
```

* Установка тактовой частоты для интерфейса Serial:
```bash
router(config-if)#clock rate 64000
```

* Проверка интерфейса Serial:
```bash
router(config)#show interfaces s0/0
```

* Добавить статическую запись в таблицу маршрутизации:
```bash
Router(config)#ip route 10.10.10.0 255.255.255.0 {ip-address | exit-interface }
```

* Посмотреть таблицу маршрутизации:
```bash
R1#show ip route
```

* Посмотреть интерфейсы:
```bash
R1#show interfaces
```

* Посмотреть интерфейсы и их статистику в табличном виде:
```bash
R1#show ip interface brief
```

* Посмотреть соседей устройства:
```bash
Router#show cdp neighbors
Router#show cdp neighbors detail
```

* Глобальное выключение CDP (cisco discovery protocol):
```bash
Router(config)#no cdp run
```

* Выключение CDP (cisco discovery protocol) на интерфейсе:
```bash
Router(config-if)#no cdp enable
```

* Статус DTE/DCE:
```bash
router#show controllers s0/0
```

* Сохранение конфигурации:
```bash
router#copy running-config startup-config
```

* Загрузка файла (например IOS) с TFTP сервера:
```bash
R#copy tftp flash:
```

* Резервное копирование Startup конфига на TFTP:
```bash
router#copy startup-config tftp
```

* Сохранение Running конфига:
```bash
router#write memory
router#copy run st
```

* Удаление конфигурации NVRAM:
```bash
router#write erase
```

* Проверка конфигурации NVRAM:
```bash
router#show startup-config
```

* Посмотреть таблицу MAC адресов свитча:
```bash
show mac-address-table
```

* Статически прописать MAC адрес в таблицу адресов свитча:
```bash
router#mac-address-table static MAC address vlan {1-4096, ALL} interface interface-id command
```

* Создать VLAN:
```bash
S1(config)#vlan 20
S1(config-vlan)#name students
```

* Создаем интерфейс для управления VLAN:
```bash
S1(config)#interface vlan 20
S1(config-if)#ip address 10.2.2.1 255.255.255.0
S1(config-if)#no shutdown
```

* Назначить порт для доступа к VLAN:
```bash
S1(config)#interface fa0/18
S1(config-if)#switchport mode access
S1(config-if)#switchport access vlan 20
```

* Назначить порт для транка Cisco Dynamic Trunking protocol:
```bash
S1(config)#interface fa0/18
S1(config-if)#switchport mode trunk
S1(config-if)#switchport mode dynamic auto
S1(config-if)#switchport mode dynamic desirable
S1(config-if)#switchport mode nonegotiate
```

* какие vlan пропускать через trunk:
```bash
S1(config-if)#switchport trunk allowed vlan 18 (можно указывать диапазоны или all)
```

* Переключиться обратно из trunk в режим доступа:
```bash
S1(config-if)#no switchport trunk allowed vlan
S1(config-if)#no switchport trunk native vlan
S1(config-if)#switchport mode access
```

* Разрешить трафик местного (native) VLAN через порт транка:
```bash
S1(config)#interface fa0/18
S1(config-if)#switchport mode trunk
S1(config-if)#switchport trunk native vlan 18
S1#show interfaces fa0/18 switchport
```

* Посмотреть статистику VLAN:
```bash
show vlan brief
show vlan id 20
show vlan name students
show vlan summary
```

* Посмотреть статистику портов свитча:
```bash
show interfaces vlan 20
show interfaces fa0/18 switchport
```

* Назначить шлюз по умолчанию:
```bash
S1(config)#ip default gateway 1.2.3.4
```

* Включить протокол динамической маршрутизации:
```bash
R1(config)#router протокол (rip, eigrp и т.д.)
R1(config-router)#network network_number [wildcard_mask]
R1(config-if)#bandwidth 64
```

* Выключить динамическую маршрутизацию на интерфейсе
```bash
R1(config-router)#passive-interface s 0/0/0 
```
or

```bash
R1(config-router)#passive-interface default
```

* Выключить динамическую маршрутизацию на всех интерфейсах, а потом на некоторых включить:
```bash
R1(config-router)#no passive-interface s 0/0/0
```

-----

[Source](http://network.xsp.ru/4_10.php)

-----